feat: adding more visuals
